###############################################################################
#
# システム画面系の言語別テキスト設定

!section system
#------------------------------------------------------------------------------
# システム全般

# ウィンドウタイトルバーのキャプション
TitleCaption		Maitetsu Last Run!! [Viet Hoa]

# シナリオ開放通知 t1=chapter t2=title
PopupTextFormat_AddExtraScn	　${t1}.${t2}
PopupTextFormat_AddMultiScn	　${count}本のシナリオを開放
PopupTextFormat_AddNewRoute	　${vol}開放
PopupTextFormat_AddMulRoute	　${count}本のルートを開放
PopupTextFormat_AddTitleScr	　タイトル画面背景を更新

#------------------------------------------------------------------------------
# セーブ画面

# コメント入力
SaveCommentInput	クリックしてコメントを記入
SaveCommentDialog	${num} のコメントを編集
SaveCommentContinue	…

# MEMO: 日付表示フォーマットはプログラム側での特殊対応で対処済み

#------------------------------------------------------------------------------
# バックログ画面

# 選択肢分岐の選択内容表記
BacklogChoiceTextFormat	選択肢: ${text}

#------------------------------------------------------------------------------
# コンフィグ画面

# テキストプレビュー（,で改行)
ConfigPreviewText	テキスト速度のサンプルと、,オート速度のサンプルです。,～　まいてつ　～

ConfigLanguageSelect	Game Language/言語選択

###############################################################################
#
# Windowsダイアログ系の言語別テキスト設定

!section dialog
#------------------------------------------------------------------------------

# ダイアログ汎用
DialogOK		OK
DialogCancel		キャンセル
DialogClose		閉じる
DialogInit		初期設定
DialogDetail		詳細情報

DialogText_AskTitle		タイトルに戻りますか？
DialogText_AskExit		ゲームを終了しますか？
DialogText_AskInit		初期設定に戻しますか？
DialogText_AskLoad		ここから再開しますか？
DialogText_AskSave		ブックマークしますか？
DialogText_AskJump		ジャンプしますか？
DialogText_AskQuitReplay	回想を中断しますか？
DialogText_AskDelete		本当に削除しますか？
DialogText_鑑賞画面をすべて開放しますか？	鑑賞画面をすべて開放しますか？

# バージョン情報 （メニューバーの「ヘルプ／バージョン情報」で開くウィンドウのタイトル）
VersionInfo		バージョン情報

# フォント選択ダイアログ
FontDialogCaption	フォントの選択
FontDialogDoSelect	フォントを選択してください
FontDialogLicenseHead	「${name}」のライセンス
FontDialogLicenseInfo	このフォントのライセンスは詳細情報ボタンで確認してください
FontDialogInfoFormat	${name}の詳細情報
FontDialogEmbeddedMark	■

# Embedded Font Face Alias
FontFace_思源黑体R		(简体)思源黑体R
FontFace_思源黑体B		(简体)思源黑体B
FontFace_思源黑体H		(简体)思源黑体H
FontFace_思源宋体B		(简体)思源宋体B
FontFace_思源宋体H		(简体)思源宋体H
FontFace_思源黑體R		(繁体)思源黑體R
FontFace_思源黑體B		(繁体)思源黑體B
FontFace_思源黑體H		(繁体)思源黑體H
FontFace_思源宋體B		(繁体)思源宋體B
FontFace_思源宋體H		(繁体)思源宋體H

# Cannot use @ jp-text
FontUnuse_思源黑体R		-
FontUnuse_思源黑体B		-
FontUnuse_思源黑体H		-
FontUnuse_思源宋体B		-
FontUnuse_思源宋体H		-
FontUnuse_思源黑體R		-
FontUnuse_思源黑體B		-
FontUnuse_思源黑體H		-
FontUnuse_思源宋體B		-
FontUnuse_思源宋體H		-


# フォント変更の警告
WarnChangeUserFont	ユーザー独自のフォントに変更した場合、選択したフォントによってはゲーム本文メッセージが正しく表示されないことがありますので予めご了承ください

# 高度な設定の一部設定変更後
# 	「ヘルプ／高度な設定を表示」で「高度な設定」内の
#	「マウスホイールの取得方法を変更」(InfoApplyOnRestart)等や「最大フレームレート」(InfoApplyOnAfter)を変更後
#	※表示されるのは各項目ごと起動中１回のみ
InfoApplyOnRestart	設定は再起動後に有効となります
InfoApplyOnAfter	設定は即座に反映されない場合があります

# 開始メニューの表示
#	「ヘルプ／開始メニューの表示」から
#	※ゲームがインストールされた状態でないと選択できません
BootStrapKickConfirm	ゲームを終了して開始メニューを表示します
BootStrapKickFailed	開始メニューの起動に失敗しました

# ゲームパッドのボタン割り当て変更
# 	「ヘルプ／高度な設定を表示」で「高度な設定」内の「ゲームパッドのボタン割り当て変更」から
GamePadBindCaption	ゲームパッド割り当て変更
GamePadBindHeader	ゲームパッドボタン
GamePadBindButton	ボタン${num}
GamePadBindKeyName	${key}キー
GamePadBindNothing	なし

# ファイル選択拡張子
FileSelectExts*			すべてのファイル
FileSelectExtsTXT		テキストファイル
FileSelectExtsEXE		実行ファイル


# テキスト読み上げ定義
ttsdata_LangName	Japanese
ttsdata_Sample		こんにちは

ttsdata_PrimLangID	11
ttsdata_DictEnabled	1
#ttsconf_VoParamLeftPer	40

# テキスト読み上げ設定
ttsconf_Title			テキスト読み上げ機能設定
ttsconf_TargetLang		対象言語：${name}

ttsconf_grpALL			読み上げ設定
ttsconf_Enabled			テキスト読み上げ機能を有効にする

ttsconf_grpTYPE			音声合成方法
ttsconf_UseSAPI			Speech API
ttsconf_UseMSSP			Microsoft Speech Platform
ttsconf_UseXAPP			外部アプリケーション呼び出し
ttsconf_AppSel			選択
ttsconf_fileAppSel		外部アプリケーション選択

ttsconf_grpVOICE		音声パラメータ
ttsconf_NamLabel		声なし発言
ttsconf_DscLabel		地の文章
ttsconf_ComLabel		共通設定

ttsconf_ComSetting		共通設定
ttsconf_SepSetting		専用設定
ttsconf_Disabled		無効

ttsconf_Play			発声
ttsconf_Config			設定

ttsconf_txtLABEL		↑発声テスト文章

ttsconf_EnvSave			設定の保存
ttsconf_EnvLoad			設定の読み込み
ttsconf_dlgEnvSave		ユーザー環境変数「${key}」に設定を保存します。\nよろしいですか？
ttsconf_dlgEnvLoad		ユーザー環境変数「${key}」から設定を読み込みます。\nよろしいですか？

ttsconf_grpVOLUME		音量
ttsconf_VolGame			ゲーム中の全体ボイス音量設定
ttsconf_VolIndep		独立した音量設定

ttsconf_grpDICT			読み上げ辞書
ttsconf_DictUnsupport		- サポートされていません -
ttsconf_DictImport		インポート
ttsconf_DictExport		エクスポート
ttsconf_DictAdd			＋
ttsconf_DictUp			↑
ttsconf_DictDown		↓
ttsconf_DictSel			＠
ttsconf_DictDel			×
ttsconf_fileDictImport		読み上げ辞書のインポート
ttsconf_fileDictExport		読み上げ辞書のエクスポート
ttsconf_dlgImport		既存の読み上げ辞書が存在します。維持したままインポートしますか？（同名の単語があった場合は上書きされます）
ttsconf_dlgImportFailed		インポートに失敗しました
ttsconf_dlgExportFailed		エクスポートに失敗しました
ttsconf_exportTextHeader	読み上げ辞書一覧ファイル（タブ区切りテキスト）

ttsconf_Help			ヘルプ

# 音声パラメータ設定
ttstoken_Title			音声パラメータ設定(${name})
ttstoken_grpALL			${name}パラメータ
ttstoken_Test			発声テスト
ttstoken_Token			話者
ttstoken_EnPitch		音程
ttstoken_EnRate			速さ

ttstoken_TitleXAPP		音声パラメータ設定(外部アプリケーション呼び出し)
ttstoken_CmdTarget		実行ファイル：
ttstoken_NoCmdTarget		*コマンドを設定してください*
ttstoken_CmdArgs		コマンドラインオプション：
ttstoken_Description		補足説明：

# 読み上げ辞書追加・編集
ttsdict_TitleNew		読み上げ辞書追加
ttsdict_TitleEdit		読み上げ辞書編集
ttsdict_grpALL			読み上げ辞書
ttsdict_DictWord		単語
ttsdict_DictRead		読み
ttsdict_Add			追加
ttsdict_Edit			編集



# ビットマップメモリ確保失敗時の再起動復帰確認
EmergencyRebootConfirm	ビットマップ用メモリが確保できませんでした。ゲームを再起動して復帰処理を試みますか？
EmergencyRebootExit	（いいえを押すとゲームを強制終了します）

# システムデータの保存に失敗した時（リトライ／キャンセル確認）
ErrorSaveSystemVars	システムセーブデータの保存に失敗しました。正しく保存できないと次回起動時に設定やフラグが初期化される場合があります。ディスクの空き容量などを確認して再度保存を試みてください。


# MEMO
#
# - AskYesNoでダイアログの出ない特殊確認（主にエラー時）⇒まず起こらないのでスルーで
#	error:セーブデータの不整合が検出されました。正常動作は保障されませんが。該当シーンの冒頭から再開しますか？
#	error:指定テキスト ${text} まで移動できません。該当シナリオの冒頭から再開しますか？
#	error:指定行 ${line} まで移動できません。該当シナリオの冒頭から再開しますか？
#	シナリオのラベル位置変更が検出されました。不整合の可能性がありますがそのまま再開しますか？
#	シナリオのラベル不整合が検出されました。正常動作は保障されませんが、該当シナリオの冒頭から再開しますか？
#	セーブデータの不整合が検出されました。正常動作は保障されませんが、該当シナリオの冒頭から再開しますか？

###############################################################################
#
# メニューバーの言語別テキスト設定

!section menu
#------------------------------------------------------------------------------
systemMenu		ファイル(&F)
storeMenu			ここでブックマーク(&S)
restoreMenu			ブックマーク管理(&L)
#quickStoreMenu			クイックセーブ(&W)
#quickRestoreMenu		クイックロード(&Q)
#				-
goToStartMenuItem		タイトルへ戻る(&T)
#				-
quickRebootMenuItem		クイック再起動(&R)
exitMenuItem			終了(&X)

#------------------------------------------------------------------------------
displayMenu		画面(&S)
windowedMenuItem		ウィンドウ表示(&W)
fullScreenMenuItem		フルスクリーン(&F)
#				-
winResMenu			ウィンドウ表示時サイズ(&S)
resetWindowSizeMenuItem			標準：等倍サイズ(&D)
disableWindowResizeMenuItem		${w} x ${h} で固定(${amp}F)
smoothZoomMenuItem		拡大時スムージング(&T)
#				-
effectCheckMenuItem		画面効果(&E)
sceneAnimMenuItem		アニメ効果(&A)
chChangeFontMenuItem		フォント(&F) ...
stopDeactiveMenuItem		非アクティブ時に停止(&P)
stayOnTopMenuItem		常に手前に表示(&Y)

#------------------------------------------------------------------------------
textLanguageMenu	テキスト言語(&L)
textLanguageMenuItem	メイン
textLanguageMenuItem_jp		日本語(&J)
textLanguageMenuItem_en		&English
textLanguageMenuItem_cn		简体中文(&C)
textLanguageMenuItem_tw		Tiếng Việt(&T)
subLanguageMenuItem	サブ
subLanguageMenuItem_jp		日本語
subLanguageMenuItem_en		English
subLanguageMenuItem_cn		简体中文
subLanguageMenuItem_tw		Tiếng Việt
subLanguageMenuItem_none	なし
useMultiLangMenuItem		多言語表示にする
swapMainSubLangMenuItem		メインとサブを入れ替える

#------------------------------------------------------------------------------
systemControlMenu	進行制御(&M)
showHistoryMenuItem		バックログ(&L)
autoModeMenuItem		オート(&A)
skipToNextStopMenuItem		スキップ(&S)
#				-
goNextMenuItem			次の選択肢へ進む(&N)
goBackMenuItem			前の選択肢に戻る(&B)
#				-
configMenuItem			オプション(&O)
voiceReplayMenuItem		音声リプレイ(&R)

sndoptMenuItem			サウンド設定(&S)
keyoptMenuItem			ショートカットキー設定(&K)
tipsviewMenuItem		&TIPS画面
scnselMenuItem			シナリオ選択(&M)

#------------------------------------------------------------------------------
helpMenu		ヘルプ(&H)
helpWebMenuItem			&WEBサイトを開く
#				-
helpBootStrapMenuItem		開始メニューの表示(&S)
showAdvancedMenuItem		高度な設定を表示(&A)
#				-
helpAboutMenuItem		バージョン情報(&A)
helpIndexMenuItem		オンラインマニュアル(&M)

#------------------------------------------------------------------------------
debugMenu		デバッグ(&D)

#------------------------------------------------------------------------------
troubleShootMenu	高度な設定(&A)
videoOverlayModeMenu		ムービー表示
:vomstyle=auto				自動設定
:vomstyle=overlay			オーバーレイ
:vomstyle=mixer				ミキサー
:vomstyle=layer				レイヤー
pseudoFullScreenModeMenu	複数モニタ全画面
:fullscreenmode=auto			自動設定
:fullscreenmode=primaryonly		常にプライマリを使用
:fullscreenmode=usepseudo		プライマリかどうかで選択
:fullscreenmode=pseudoall		常に擬似最大化表示
fullScrResMenu			フルスクリーン時解像度(&R)
fsmethodMenuItem			解像度切り替えの方法を変更
#					-
:fsres=auto				自動設定(&A)
:fsres=nochange				解像度を変えない(&O)
:fsres=nearest				最も近い解像度(&N)
:fsres=proportional			縦横比が同じ解像度(&P)
#					-
:fszoom=inner				内接で拡大：端に黒帯(&I)
:fszoom=outer				外接で拡大：端をカット(&C)
:fszoom=no				拡大しない：中央に表示(&D)
#fullScrResMiddleMenuItem		中間で拡大：カットして黒帯(&M)
#					-
#middleZoomPercentMenuItem		拡大割合指定(&Z)
dispDoubleBufferMenu		表示方式(&D)
:dbstyle=auto				自動設定(&A)
:dbstyle=d3d				Direct3D(&3)
:dbstyle=ddraw				DirectDraw(&D)
:dbstyle=gdi				GDI(&G)
#					-
useDoubleBufferMenuItem			等倍時にDI&B方式を使用
waitVSyncMenuItem			画面更新に垂直同期を待つ
fpsLimitMenu			最大フレームレート(&M)
:contfreq=0				制限なし(&N)
:contfreq=144				1&44フレーム/秒
:contfreq=120				1&20フレーム/秒
:contfreq=90				&90フレーム/秒
:contfreq=75				&75フレーム/秒
:contfreq=60				&60フレーム/秒
:contfreq=45				4&5フレーム/秒
:contfreq=30				&30フレーム/秒
:contfreq=15				&15フレーム/秒
multiThreadDrawMenu		描画スレッド分割数(&N)
:drawthread=1				無効：スレッド分割しない(&D)
:drawthread=auto			自動：プロセッサ数で分割(&A)
#					-
:drawthread=2				2スレッド
:drawthread=4				4スレッド
:drawthread=8				8スレッド
#				-
disableCursorMoveMenuItem	マウスカーソルの自動移動を禁止
mouseWheelMsgMenuItem		マウスホイールの取得方法を変更
disableJoypadMenuItem		ゲームパッドの使用禁止
bindGamePadButtonMenuItem	ゲームパッドのボタン割り当て変更
#				-
lowMemoryPerfMenuItem		省メモリ動作モード
#				-
msgHackChFadeMenu		テキストフェード表示(&F)
msgHackChFadeMenuItem_なし		なし
msgHackChFadeMenuItem_fast		短い
msgHackChFadeMenuItem_normal		普通
msgHackChFadeMenuItem_slow		長い
#
useDirect3DModeMenuItem		Direct&3D版E-moteを使用

#------------------------------------------------------------------------------
# メニューバーの右クリック／ALT+Spaceシステムメニュー拡張
menuBarHideMenu			メニューバー
menuBarShowAlwaysMenuItem		常に表示
menuBarHideAlwaysMenuItem		常に非表示
menuBarAutoShowHideMenuItem		動的に表示


###############################################################################
# 追加メッセージ

# 高度な設定内メニュー
useCompTextureMenuItem		Direct3D版E-moteで圧縮テクスチャを使用
useD3DMotionMenuItem		吉里吉里版EmoteでD3Dモードを使用

# 起動時D3Dモード失敗エラー
D3DFail				DirectX の初期化に失敗しました。DirectX の最新版が必要です:${message}

# Steam関係
useSteamCloudMenuItem		セーブデータをSteam Cloudに保存する
steamUploadMenuItem		セーブデータをSteam Cloudにアップロードする
steamDownloadMenuItem		セーブデータをSteam Cloudからダウンロードする
steamDeleteMenuItem		Steam Cloudのセーブデータを削除する
askSteamUpload			SteamCloud にローカルのセーブデータをアップロードしますか？
askSteamDownload		SteamCloud からセーブデータをダウンロードしますか？(既読フラグはマージされます)
askSteamDelete			SteamClound のセーブデータを消去しますか？
askInitialSteamUpload		SteamCloudにセーブデータがありません。ローカルのセーブデータをアップロードしますか？

# 同時表示処理
showUILangScriptMenuItem	UI言語のテキストを同時表示する

# R18配信ブロック
steamBroadcastDisable		SteamでのR18コンテンツの配信はできません

# テキスト読み上げ
textSpeechMenuItem		テキスト読み上げ...



# TitleStartCaptions (for start story button popup in title screen)
TitleStartCaption_gs_c		共通ルート
TitleStartCaption_gs_86		ハチロクルート
TitleStartCaption_gs_hb		日々姫ルート
TitleStartCaption_gs_po		ポーレットルート
TitleStartCaption_gs_ma		真闇ルート
TitleStartCaption_gs_ks		稀咲ルート
TitleStartCaption_gs_nf		凪＆ふかみルート
TitleStartCaption_gs_re		れいなルート
TitleStartCaption_gs_26		ニイロクルート
TitleStartCaption_gs_gr		グランドルート
TitleStartCaption_gs_ch		仲国ルート
TitleStartCaption_exp_ql	前回中断した所から
TitleStartCaption_exp_ss	場面選択
TitleStartCaption_exp_ho	シーン全開放

# 前作プレイ確認ダイアログ
DialogText_AskFirstPlay		前作「まいてつ」をプレイ済みですか？
FirstPlayUpdateFlags		既読情報を更新しました。新作シナリオからプレイ開始できます。
FirstPlayUpdateError		既読情報の更新に失敗しました。
